In [1]:
# Series
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [2]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [3]:
pd.Series(data = my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [4]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [5]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [8]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [10]:
ser1 = pd.Series([1,2,3,4],["USA",'Germany','USR','Japan'])

In [11]:
ser1

USA        1
Germany    2
USR        3
Japan      4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,3,5],['USA','Japan','Italy','Germany'])

In [13]:
ser2

USA        1
Japan      2
Italy      3
Germany    5
dtype: int64

In [14]:
ser1['USA']

1

In [15]:
ser1 + ser2

Germany    7.0
Italy      NaN
Japan      6.0
USA        2.0
USR        NaN
dtype: float64

In [19]:
import numpy as np
import pandas as pd

In [20]:
from numpy.random import randn

In [21]:
np.random.seed(101)

In [25]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [23]:
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [26]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [27]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [28]:
type(df)

pandas.core.frame.DataFrame

In [29]:
df.W

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [30]:
df[['X','W']]

          X         W
A  0.196800 -0.993263
B -0.156598  1.025984
C -0.610259  2.154846
D -0.479448  0.147027
E  1.862864 -0.925874

In [31]:
df['New'] = pd.Series([1,2,3,4])

In [32]:
df['A'] = df['W'] + df['X']

In [33]:
df

          W         X         Y         Z  New         A
A -0.993263  0.196800 -1.136645  0.000366  NaN -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  NaN  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  NaN  1.544588
D  0.147027 -0.479448  0.558769  1.024810  NaN -0.332421
E -0.925874  1.862864 -1.133817  0.610478  NaN  0.936990

In [34]:
df.drop('New',axis=1,inplace=True)

In [35]:
df

          W         X         Y         Z         A
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421
E -0.925874  1.862864 -1.133817  0.610478  0.936990

In [36]:
df.drop('E')

          W         X         Y         Z         A
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421

In [37]:
df.shape

(5, 5)

In [38]:
df

          W         X         Y         Z         A
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421
E -0.925874  1.862864 -1.133817  0.610478  0.936990

In [39]:
df.loc['A']

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
A   -0.796464
Name: A, dtype: float64

In [40]:
df.iloc[0]

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
A   -0.796464
Name: A, dtype: float64

In [41]:
df.loc['A','Y']

-1.1366445936091856

In [42]:
df.loc[['A','B']]

          W         X         Y         Z         A
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386

In [43]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.993263 -1.136645
B  1.025984 -0.031579

In [44]:
df > 0

       W      X      Y      Z      A
A  False   True  False   True  False
B   True  False  False   True   True
C   True  False  False  False   True
D   True  False   True   True  False
E  False   True  False   True   True

In [45]:
df[df > 0]

          W         X         Y         Z         A
A       NaN  0.196800       NaN  0.000366       NaN
B  1.025984       NaN       NaN  0.649826  0.869386
C  2.154846       NaN       NaN       NaN  1.544588
D  0.147027       NaN  0.558769  1.024810       NaN
E       NaN  1.862864       NaN  0.610478  0.936990

In [47]:
df['W'] > 0

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [48]:
df[df['W'] > 0]

          W         X         Y         Z         A
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421

In [49]:
df[df['Z'] < 0]

          W         X         Y         Z         A
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588

In [50]:
resultdf = df[df['Z'] < 0]
resultdf['X']

C   -0.610259
Name: X, dtype: float64

In [52]:
df[df['Z'] < 0][['X','Z']]

          X         Z
C -0.610259 -0.346419

In [62]:
df[(df['W']>1) & (df['Y']<0)]

          W         X         Y         Z         A
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588

In [64]:
df[(df['W']>1) | (df['Y']<0)]

          W         X         Y         Z         A
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
E -0.925874  1.862864 -1.133817  0.610478  0.936990

In [65]:
df

          W         X         Y         Z         A
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421
E -0.925874  1.862864 -1.133817  0.610478  0.936990

In [66]:
df.reset_index()

  index         W         X         Y         Z         A
0     A -0.993263  0.196800 -1.136645  0.000366 -0.796464
1     B  1.025984 -0.156598 -0.031579  0.649826  0.869386
2     C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
3     D  0.147027 -0.479448  0.558769  1.024810 -0.332421
4     E -0.925874  1.862864 -1.133817  0.610478  0.936990

In [68]:
df

          W         X         Y         Z         A
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421
E -0.925874  1.862864 -1.133817  0.610478  0.936990

In [69]:
newInd='CA NY WY OR CO'.split()

In [70]:
newInd

['CA', 'NY', 'WY', 'OR', 'CO']

In [71]:
df['States'] =newInd

In [72]:
df

          W         X         Y         Z         A States
A -0.993263  0.196800 -1.136645  0.000366 -0.796464     CA
B  1.025984 -0.156598 -0.031579  0.649826  0.869386     NY
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588     WY
D  0.147027 -0.479448  0.558769  1.024810 -0.332421     OR
E -0.925874  1.862864 -1.133817  0.610478  0.936990     CO

In [73]:
df.set_index('States')

               W         X         Y         Z         A
States
CA     -0.993263  0.196800 -1.136645  0.000366 -0.796464
NY      1.025984 -0.156598 -0.031579  0.649826  0.869386
WY      2.154846 -0.610259 -0.755325 -0.346419  1.544588
OR      0.147027 -0.479448  0.558769  1.024810 -0.332421
CO     -0.925874  1.862864 -1.133817  0.610478  0.936990

In [75]:
df.set_index('States',inplace=True)

In [76]:
df

               W         X         Y         Z         A
States
CA     -0.993263  0.196800 -1.136645  0.000366 -0.796464
NY      1.025984 -0.156598 -0.031579  0.649826  0.869386
WY      2.154846 -0.610259 -0.755325 -0.346419  1.544588
OR      0.147027 -0.479448  0.558769  1.024810 -0.332421
CO     -0.925874  1.862864 -1.133817  0.610478  0.936990

In [77]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [78]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [79]:
inside

[1, 2, 3, 1, 2, 3]

In [80]:
zip(outside,inside)

In [81]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [82]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [83]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [84]:
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [85]:
df.loc['G1']

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [87]:
df.loc['G1'].loc[1]

A    0.386030
B    2.084019
Name: 1, dtype: float64

In [89]:
df.index.names = ['outside','inside']

In [90]:
df

                       A         B
outside inside
G1      1       0.386030  2.084019
        2      -0.376519  0.230336
        3       0.681209  1.035125
G2      1      -0.031160  1.939932
        2      -1.005187 -0.741790
        3       0.187125 -0.732845

In [91]:
df.loc['G2'].loc[2,'B']

-0.7417897046689249

In [92]:
df.xs('G1')

               A         B
inside
1       0.386030  2.084019
2      -0.376519  0.230336
3       0.681209  1.035125

In [94]:
df.xs(1,level='inside')

               A         B
outside
G1       0.38603  2.084019
G2      -0.03116  1.939932

In [95]:
df={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [96]:
df=pd.DataFrame(df)

In [97]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [98]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [99]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [101]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [102]:
df.fillna(value='FILL')

      A     B  C
0   1.0   5.0  1
1   2.0  FILL  2
2  FILL  FILL  3

In [103]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [105]:
data = {'Company':['Googl','Goog','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [106]:
df = pd.DataFrame(data)

In [107]:
df

  Company   Person  Sales
0   Googl      Sam    200
1    Goog  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [108]:
df.groupby('Company')

In [109]:
df.groupby('Company').mean()

C:\Users\micha\AppData\Local\Temp\ipykernel_18276\2058252646.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').mean()

         Sales
Company
FB       296.5
Goog     120.0
Googl    200.0
MSFT     232.0

In [111]:
df.groupby('Company').std()

C:\Users\micha\AppData\Local\Temp\ipykernel_18276\2093150834.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').std()

              Sales
Company
FB        75.660426
Goog            NaN
Googl           NaN
MSFT     152.735065

In [114]:
df.groupby('Company').sum().loc['FB']

C:\Users\micha\AppData\Local\Temp\ipykernel_18276\3563751855.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [116]:
df.groupby('Person').count()

         Company  Sales
Person
Amy            1      1
Carl           1      1
Charlie        1      1
Sam            1      1
Sarah          1      1
Vanessa        1      1

In [117]:
df.groupby('Person').max()

        Company  Sales
Person
Amy        MSFT    340
Carl         FB    243
Charlie    Goog    120
Sam       Googl    200
Sarah        FB    350
Vanessa    MSFT    124

In [118]:
df.groupby('Person').min()

        Company  Sales
Person
Amy        MSFT    340
Carl         FB    243
Charlie    Goog    120
Sam       Googl    200
Sarah        FB    350
Vanessa    MSFT    124

In [119]:
df.groupby('Person').describe()

        Sales
        count   mean std    min    25%    50%    75%    max
Person
Amy       1.0  340.0 NaN  340.0  340.0  340.0  340.0  340.0
Carl      1.0  243.0 NaN  243.0  243.0  243.0  243.0  243.0
Charlie   1.0  120.0 NaN  120.0  120.0  120.0  120.0  120.0
Sam       1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
Sarah     1.0  350.0 NaN  350.0  350.0  350.0  350.0  350.0
Vanessa   1.0  124.0 NaN  124.0  124.0  124.0  124.0  124.0

In [122]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Goog      1.0  120.0         NaN  120.0  120.00  120.0  120.00  120.0
Googl     1.0  200.0         NaN  200.0  200.00  200.0  200.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [123]:
df.groupby('Company').describe().transpose()

Company              FB   Goog  Googl        MSFT
Sales count    2.000000    1.0    1.0    2.000000
      mean   296.500000  120.0  200.0  232.000000
      std     75.660426    NaN    NaN  152.735065
      min    243.000000  120.0  200.0  124.000000
      25%    269.750000  120.0  200.0  178.000000
      50%    296.500000  120.0  200.0  232.000000
      75%    323.250000  120.0  200.0  286.000000
      max    350.000000  120.0  200.0  340.000000

In [124]:
data1 = {
    'Name': ['John', 'Alice', 'Bob'],
    'Age': [25, 30, 35],
    'City': ['New York', 'London', 'Paris']
}
df1 = pd.DataFrame(data1)

In [125]:
data2 = {
    'Country': ['USA', 'Canada', 'Australia'],
    'Population': [328, 38, 25],
    'Area': [9827, 9976, 7692]
}
df2 = pd.DataFrame(data2)

In [126]:
data3 = {
    'Fruit': ['Apple', 'Banana', 'Orange'],
    'Color': ['Red', 'Yellow', 'Orange'],
    'Price': [0.5, 0.25, 0.4]
}
df3 = pd.DataFrame(data3)

In [128]:
pd.concat([df1,df2,df3])

    Name   Age      City    Country  Population    Area   Fruit   Color  Price
0   John  25.0  New York        NaN         NaN     NaN     NaN     NaN    NaN
1  Alice  30.0    London        NaN         NaN     NaN     NaN     NaN    NaN
2    Bob  35.0     Paris        NaN         NaN     NaN     NaN     NaN    NaN
0    NaN   NaN       NaN        USA       328.0  9827.0     NaN     NaN    NaN
1    NaN   NaN       NaN     Canada        38.0  9976.0     NaN     NaN    NaN
2    NaN   NaN       NaN  Australia        25.0  7692.0     NaN     NaN    NaN
0    NaN   NaN       NaN        NaN         NaN     NaN   Apple     Red   0.50
1    NaN   NaN       NaN        NaN         NaN     NaN  Banana  Yellow   0.25
2    NaN   NaN       NaN        NaN         NaN     NaN  Orange  Orange   0.40

In [129]:
pd.concat([df1,df2,df3],axis=1)

    Name  Age      City    Country  Population  Area   Fruit   Color  Price
0   John   25  New York        USA         328  9827   Apple     Red   0.50
1  Alice   30    London     Canada          38  9976  Banana  Yellow   0.25
2    Bob   35     Paris  Australia          25  7692  Orange  Orange   0.40

In [137]:
# Join on Columns
data1 = {
    'ID': [1, 2, 3],
    'Name': ['John', 'Alice', 'Bob'],
    'Age': [25, 30, 35]
}
df1 = pd.DataFrame(data1)

data2 = {
    'ID': [2, 3, 4],
    'City': ['London', 'Paris', 'Berlin'],
    'Salary': [5000, 6000, 7000]
}
df2 = pd.DataFrame(data2)

# Merge the DataFrames based on the 'ID' column
merged_df = pd.merge(df1, df2, on='ID',how='inner')

In [138]:
merged_df

   ID   Name  Age    City  Salary
0   2  Alice   30  London    5000
1   3    Bob   35   Paris    6000

In [143]:
joined_df = df1.join(df2.set_index('ID'), on='ID', how='inner')

print(joined_df)

   ID   Name  Age    City  Salary
1   2  Alice   30  London    5000
2   3    Bob   35   Paris    6000

In [145]:
joined_df = df1.join(df2)

print(joined_df)

ValueError: columns overlap but no suffix specified: Index(['ID'], dtype='object')

In [146]:
# Create two sample DataFrames
data1 = {
    'ID': [1, 2, 3],
    'Name': ['John', 'Alice', 'Bob'],
    'Age': [25, 30, 35]
}
df1 = pd.DataFrame(data1)

data2 = {
    'ID': [2, 3, 4],
    'City': ['London', 'Paris', 'Berlin'],
    'Salary': [5000, 6000, 7000]
}
df2 = pd.DataFrame(data2)

# Perform inner join on 'ID' column
joined_df = df1.merge(df2, on='ID', how='inner')

print(joined_df)

   ID   Name  Age    City  Salary
0   2  Alice   30  London    5000
1   3    Bob   35   Paris    6000

In [148]:
df2['City'].unique()

array(['London', 'Paris', 'Berlin'], dtype=object)

In [149]:
df2['City'].nunique()

3

In [150]:
df2['City'].value_counts()

London    1
Paris     1
Berlin    1
Name: City, dtype: int64

In [151]:
def times2(x):
    return x*2

df2['Salary'].apply(times2)

0    10000
1    12000
2    14000
Name: Salary, dtype: int64

In [152]:
df.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [153]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [154]:
df

  Company   Person  Sales
0   Googl      Sam    200
1    Goog  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [156]:
df.sort_values(by='Sales')

  Company   Person  Sales
1    Goog  Charlie    120
3    MSFT  Vanessa    124
0   Googl      Sam    200
4      FB     Carl    243
2    MSFT      Amy    340
5      FB    Sarah    350

In [157]:
df.isnull()

   Company  Person  Sales
0    False   False  False
1    False   False  False
2    False   False  False
3    False   False  False
4    False   False  False
5    False   False  False

In [158]:
pwd

'C:\\Users\\micha\\Documents\\Python\\AI'

In [159]:
pd.read_csv('example.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'example.csv'

In [ ]:
pd.read_csv()

In [160]:
df = pd.read_csv('example.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'example.csv'

In [162]:
df.to_csv('My_output',index=False)

In [163]:
pd.read_csv('My_output')

  Company   Person  Sales
0   Googl      Sam    200
1    Goog  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [ ]:
pd.read_excel('Excel_Sample.xslx',sheetname='Sheet1')

In [164]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

In [166]:
data = pd.read_html('https://www.fdic.gov/index.html')

ImportError: html5lib not found, please install it

In [171]:
conda install html5lib

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

==> WARNING: A newer version of conda exists. <==
  current version: 23.3.1
  latest version: 23.5.0

Please update conda by running

    $ conda update -n base -c defaults conda

Or to minimize the number of packages updated during conda update use

     conda install conda=23.5.0

In [1]:
data = pd.read_html('https://www.fdic.gov/about/')

NameError: name 'pd' is not defined

In [ ]:
type(data)

In [2]:
import pandas as pd
import numpy as np

In [4]:
data = pd.read_html('https://news.google.com/home?hl=en-US&gl=US&ceid=US:en')

ValueError: No tables found

In [1]:
import pandas as pd

In [9]:
sal = pd.read_csv('Salaries.csv',low_memory=False)

In [10]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [11]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [43]:
sal['BasePay'] = sal['BasePay'].replace('Not Provided',0).astype('float64')

In [44]:
sal['BasePay'].replace('Not Provided',0).astype('float64').mean()

66323.6568540821

In [18]:
sal['OvertimePay'].replace('Not Provided',0).astype('float64').max()

245131.88

In [26]:
sal['EmployeeName'] = sal['EmployeeName'].astype(str)

In [27]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

In [29]:
type(sal['EmployeeName'] == 'JOSEPH DRISCOLL')

pandas.core.series.Series

In [31]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [33]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [34]:
sal['TotalPayBenefits'] = sal['TotalPayBenefits'].astype(float)

In [35]:
sal['TotalPayBenefits'].max()

567595.43

In [37]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [38]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

In [40]:
sal.iloc[sal['TotalPayBenefits'].argmin()]['EmployeeName']

'Joe Lopez'

In [45]:
sal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,0.00,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,0.00,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,0.00,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [47]:
sal.groupby('Year').mean()['BasePay']

C:\Users\micha\AppData\Local\Temp\ipykernel_33808\3145117890.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66557.437750
Name: BasePay, dtype: float64

In [49]:
sal['JobTitle'].nunique()

2159

In [57]:
sal['JobTitle'] = sal['JobTitle'].astype('string')

In [58]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  string
 3   BasePay           148049 non-null  float64
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(4), int64(2), object(6), string(1)
memory usage: 14.7+ MB

In [61]:
sal.groupby('JobTitle').count()['Id'].head()

JobTitle
ACCOUNT CLERK                  83
ACCOUNTANT                      5
ACCOUNTANT INTERN              48
ACPO,JuvP, Juv Prob (SFERS)     1
ACUPUNCTURIST                   1
Name: Id, dtype: int64

In [66]:
sal['JobTitle'].value_counts()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
                                ...
SPECIAL ASSISTANT XVIII            1
Police Services Aide               1
COURT EXECUTIVE OFFICER            1
Managing Attorney                  1
VICTIM & WITNESS TECHNICIAN        1
Name: JobTitle, Length: 2159, dtype: Int64

In [67]:
sal['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: Int64

In [70]:
sal['JobTitle']

0         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                        CAPTAIN III (POLICE DEPARTMENT)
2                        CAPTAIN III (POLICE DEPARTMENT)
3                   WIRE ROPE CABLE MAINTENANCE MECHANIC
4           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
148649                                         Custodian
148650                                      Not provided
148651                                      Not provided
148652                                      Not provided
148653                        Counselor, Log Cabin Ranch
Name: JobTitle, Length: 148654, dtype: string

In [77]:
sal.groupby('JobTitle').count().sort_values('Id',ascending=False).head()

,Id,EmployeeName,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
JobTitle,,,,,,,,,,,,
Transit Operator,7036,7036,6975,7036,7036,7036,7036,7036,7036,0,7036,2479
Special Nurse,4389,4389,4382,4389,4389,4389,4389,4389,4389,0,4389,1478
Registered Nurse,3736,3736,3725,3736,3736,3736,3736,3736,3736,0,3736,1234
Public Svc Aide-Public Works,2518,2518,2514,2518,2518,2518,2518,2518,2518,0,2518,916
Police Officer 3,2421,2421,2411,2421,2421,2421,2421,2421,2421,0,2421,783

In [78]:
sal.query('Year == 2013')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
72925,72926,Gregory P Suhr,Chief of Police,319275.01,0.0,20007.06,86533.21,339282.07,425815.28,2013,NaN,San Francisco,NaN
72926,72927,Joanne M Hayes-White,"Chief, Fire Department",313686.01,0.0,23236.0,85431.39,336922.01,422353.40,2013,NaN,San Francisco,NaN
72927,72928,Samson Lai,"Battalion Chief, Fire Suppress",186236.42,131217.63,29648.27,57064.95,347102.32,404167.27,2013,NaN,San Francisco,NaN
72928,72929,Ellen G Moffatt,Asst Med Examiner,272855.51,23727.91,38954.54,66198.92,335537.96,401736.88,2013,NaN,San Francisco,NaN
72929,72930,Robert L Shaw,"Dep Dir for Investments, Ret",315572.01,0.0,0.0,82849.66,315572.01,398421.67,2013,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
110526,110527,Arthur L Curry,PS Aide Health Services,NaN,0.0,10.67,0.0,10.67,10.67,2013,NaN,San Francisco,NaN
110527,110528,Nereida Vega,Senior Clerk,NaN,0.0,5.56,0.0,5.56,5.56,2013,NaN,San Francisco,NaN
110528,110529,Timothy E Gibson,Police Officer 3,NaN,0.0,0.0,-2.73,0.00,-2.73,2013,NaN,San Francisco,NaN
110529,110530,Mark E Laherty,Police Officer 3,NaN,0.0,0.0,-8.2,0.00,-8.20,2013,NaN,San Francisco,NaN
110530,110531,David P Kucia,Police Officer 3,NaN,0.0,0.0,-33.89,0.00,-33.89,2013,NaN,San Francisco,NaN

In [79]:
temp = sal.query('Year == 2013').groupby('JobTitle').count()

In [80]:
temp

,Id,EmployeeName,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
JobTitle,,,,,,,,,,,,
ASR Senior Office Specialist,21,21,21,21,21,21,21,21,21,0,21,0
ASR-Office Assistant,15,15,15,15,15,15,15,15,15,0,15,0
Account Clerk,90,90,87,90,90,90,90,90,90,0,90,0
Accountant I,3,3,3,3,3,3,3,3,3,0,3,0
Accountant II,77,77,77,77,77,77,77,77,77,0,77,0
...,...,...,...,...,...,...,...,...,...,...,...,...
Wire Rope Cable Maint Sprv,1,1,1,1,1,1,1,1,1,0,1,0
Worker's Comp Supervisor 1,3,3,3,3,3,3,3,3,3,0,3,0
Worker's Compensation Adjuster,25,25,25,25,25,25,25,25,25,0,25,0
X-Ray Laboratory Aide,34,34,34,34,34,34,34,34,34,0,34,0
Youth Comm Advisor,2,2,2,2,2,2,2,2,2,0,2,0

In [81]:
temp = temp[temp['Id'] == 1]

In [82]:
temp

,Id,EmployeeName,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
JobTitle,,,,,,,,,,,,
Acupuncturist,1,1,1,1,1,1,1,1,1,0,1,0
"Adm, SFGH Medical Center",1,1,1,1,1,1,1,1,1,0,1,0
Administrative Analyst I,1,1,1,1,1,1,1,1,1,0,1,0
Administrative Analyst II,1,1,1,1,1,1,1,1,1,0,1,0
"Administrator, DPH",1,1,1,1,1,1,1,1,1,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
Victim & Witness Technician,1,1,1,1,1,1,1,1,1,0,1,0
Water Meter Shop Supervisor 1,1,1,1,1,1,1,1,1,1,0,1,0
Wharfinger 1,1,1,1,1,1,1,1,1,1,0,1,0
Window Cleaner Supervisor,1,1,1,1,1,1,1,1,1,0,1,0
Wire Rope Cable Maint Sprv,1,1,1,1,1,1,1,1,1,0,1,0

In [85]:
temp.shape[0]

202

In [86]:
sum(sal[sal['Year'] == 2013]['JobTitle'].value_counts() == 1)

202

In [89]:
sal['JobTitle'].filter(regex='.*chief.*')

Series([], Name: JobTitle, dtype: string)

In [90]:
sal['title_len'] = sal['JobTitle'].apply(len)

In [92]:
sal[['TotalPayBenefits','title_len']].corr()

                  TotalPayBenefits  title_len
TotalPayBenefits          1.000000  -0.036878
title_len                -0.036878   1.000000

In [94]:
def chief_string(title):
    if 'chief' in title.lower().split():
        return True
    else:
        return False